run/solids4foam-validation/3dTube/0/fluid.pimpleFluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    symmetry-x
    {
        type         symmetryPlane;
    }
    symmetry-y
    {
        type         symmetryPlane;
    }
    outlet
    {
        type         fluxCorrectedVelocity;
    }
    inlet
    {
        type         fluxCorrectedVelocity;
    }
    wall
    {
        // Dirichlet-Neumann approach
        type         newMovingWallVelocity;
        value        uniform (0 0 0);

        // Robin-Neumann condition approach
        // type         elasticWallVelocity;
        // value        uniform (0 0 0);
    }
}

// ************************************************************************* //
