run/solids4foam-validation/3dTube/0/fluid.robin/time-series
(
    (0      1.3332)
    (3e-3   1.3332)
    (3.1e-3 0)
    (1e-2   0)
)
